app/Http/Controllers/AdminPostController.php

SELECT * FROM `posts` LIMIT 50 offset 0
SELECT count(*) as aggregate FROM `posts`
---
    public function index()
    {
        return view('admin.posts.index', [
            'posts' => Post::paginate(50),

        ]);